Repository: wp-plugins/nextgen-gallery-date
Catalog: lang/nggdate-*.po
Languages: it_it

source: <p><strong>NextGEN Gallery Date: * * A T T E N T I O N * *</strong><br />This first release require a (little and simple) NextGen GALLERY core modification in order to work.</p><p><a href="admin.php?page=nggdate#nggcoremod">Click here to read instructions</a> and <a href="admin.php?page=nggdate&action=remove-notice">click here to remove this alert.</a></p>
it_it: <p><strong>NextGEN Gallery Date: * * A T T E N Z I O N E * *</strong><br />Questa prima release richiede una (piccola e semplice) modifica ad un file di NextGen GALLERY in modo da poter funzionare.</p><p><a href="admin.php?page=nggdate#nggcoremod">Clicca qui per leggere le istruzioni</a> e <a href="admin.php?page=nggdate&action=remove-notice">clicca qui per rimuovere questo avviso.</a></p>

source: invalid date
it_it: data invalida

source: today
it_it: oggi

source: now
it_it: adesso

source: in the next minutes
it_it: nei prossimi minuti

source: in the next half hour
it_it: nella prossima mezz'ora

source: in the next hour
it_it: nella prossima ora

source: today at %s
it_it: oggi alle %s

source: just now
it_it: adesso

source: a few minutes ago
it_it: pochi minuti fa

source: in the last half hour
it_it: nell'ultima mezz'ora

source: in the last hour
it_it: nell'ultima ora

source: 1 hour ago
it_it: 1 ora fa

source: hours ago
it_it: ore fa

source: %1$s, at %2$s
it_it: %1$s, alle %2$s

source: tomorrow
it_it: domani

source: this %s
it_it: questo %s

source: next %s
it_it: il prossimo %s

source: a week of %s
it_it: una settimana di %s

source: by the end of this month
it_it: entro la fine di questo mese

source: next month
it_it: prossimo mese

source: in %s months
it_it: entro %s mesi

source: yesterday
it_it: ieri

source: last %s
it_it: ultimo %s

source: more than a week ago
it_it: più di una settimana fa

source: earlier this month
it_it: all'inizio di questo mese

source: last month
it_it: il mese scorso

source: more than a year ago
it_it: più di un anno fa

source: %s months ago
it_it: %s mesi fa

source: sets the order of the galleries by date:
it_it: imposta l'ordine delle gallerie per data:

source: Yes, sort by default settings
it_it: Si, ordina in base alle impostazioni predefinite

source: Yes, sort by newest to oldest
it_it: Si, ordina dalla più recente

source: Yes, sort by oldest to newest
it_it: Si, ordina dalla più vecchia

source: Successfully updated
it_it: Aggiornato con successo

source: NextGEN Gallery Date Options
it_it: NextGEN Gallery Date &rarr; Opzioni

source: Enable the option to sort the galleries by date added
it_it: Attivare l'opzione per ordinare le gallerie per data di inserimento

source: Yes
it_it: Si

source: If you choose YES, you will find the option to set the order when you edit an album.
it_it: Se si sceglie Sì, troverete l'opzione di scelta ordine quando si modifica un album.

source: Set the default value for the "sort galleries" option
it_it: Imposta il valore predefinito per l'opzione di ordinamento gallerie

source: If the above option is set to YES, this will define the default value for the order option you will find when you edit an album.
it_it: Se l'opzione precedente è impostata su SI, questo definirà il valore predefinito per l'opzione di ordine.

source: Save Changes
it_it: Salva le modifiche

source: <span style="color:#ff0000">[ A T T E N T I O N ] NextGEN Gallery core modification required!</span>
it_it: <span style="color:#ff0000">[ A T T E N Z I O N E ] è richiesta una modifica ad un file di NextGEN Gallery!</span>

source: <p>To use this plugin, you need to make a simple change to a NextGEN Gallery file(tested with version 1.8.3).<br />This will be necessary until the change will not be integrated (I have already sent the request to Alex Rabe).</p>To make the change, follow the instructions:<br /><br /><ol><li>Open the following file: <code>/wp-content/plugins/nextgen-gallery/<strong>nggfunctions.php</strong></code>;</li><li>The changes affect the function <strong>nggCreateAlbum</strong>, go to row <strong>580</strong>, just before the<br /><code>-----------------------<br />// check for page navigation<br />if ($maxElement > 0) {<br />------------------------</code></li><li>Enter the following filter:<br /><code>-----------------------<br /><strong>$galleries = apply_filters('ngg_album_galleries_before_paging', $galleries, $album);</strong><br />------------------------</code>;</li><li>To check if you have done correctly, <a href="/wp-content/plugins/nextgen-gallery-date/date/admin/images/ngg-new-filter.png" target="_blank"><strong>check this screenshot</strong></a>;</li><li>That's it :), <a href="admin.php?page=nggdate&action=remove-notice"><strong>Click here to remove the notice at the top</strong></a> if it is still visible.</li></ol></p>
it_it: <p>Per usare questo plugin, devi effettuare una semplice modifica ad un file di NextGEN Gallery (testato con versione 1.8.3).<br />Questa operazione sarà necessaria fino a quando la modifica non verrà integrata (ho già inviato richiesta ad Alex Rabe).</p><p>Per eseguire la modifica, seguite le istruzioni:<br /> <ol> <li>Apri il seguente file: <code>/wp-content/plugins/nextgen-gallery/<strong>nggfunctions.php</strong></code>;</li> <li>La modifica riguarderà la funzione <strong>nggCreateAlbum</strong>, vai alla riga <strong>580</strong>, subito prima di<br /> <code>-----------------------<br /> // check for page navigation<br /> if ($maxElement > 0) {<br /> ------------------------</code></li> <li>Inserisci il seguente filtro:<br /><code>-----------------------<br /><strong>$galleries = apply_filters('ngg_album_galleries_before_paging', $galleries, $album);</strong><br /> ------------------------</code>; </li><li>Per controllare se hai fatto correttamente, <a href="/wp-content/plugins/nextgen-gallery-date/date/admin/images/ngg-new-filter.png" target="_blank"><strong>guarda questo screenshot</strong></a>;</li><li>Tutto qui :) Se hai completato, <a href="admin.php?page=nggdate&action=remove-notice"><strong>clicca qui per rimuovere l'avviso in alto</strong></a> se è ancora presente.</li> </ol></p>

source: About NextGEN Gallery Date
it_it: Info su NextGEN Gallery Date

source: <p>This plugin, born as an add-on for the n.1 Wordpress Gallery Plugin <a href="http://wordpress.org/extend/plugins/nextgen-gallery/" target="_blank">NextGEN Gallery</a> (by <a href="http://alexrabe.de" target="_blank">Alex Rabe</a>), is developed by me (<a href="http://www.cantarano.com" target="_blank">check my website</a>), but it is only with your help that i can improve it, fix bugs, add some enhancements, etc...</p><p><strong>If you need to report bugs / errors / suggestions or any plugin related questions</strong>, you can leave me a message <a href="http://wordpress.org/tags/nextgen-gallery-date?forum_id=10" target="_blank">in the plugin forum</a>.</p><p style="font-size:20px;margin-top:20px">Enjoy the web ;)</p>
it_it: <p>Questo plugin, nato come un add-on per il plugin delle gallerie fotografiche di Wordpress n.1 <a href="http://wordpress.org/extend/plugins/nextgen-gallery/" target="_blank">NextGEN Gallery</a> (realizzato da <a href="http://alexrabe.de" target="_blank">Alex Rabe</a>), è sviluppato da me (<a href="http://www.cantarano.com" target="_blank">visita il mio sito web</a>), ma è solamente con il tuo aiuto che potrò continuare a migliorarlo, correggere eventuali bug, aggiungere nuove opzioni, ecc...</p><p><strong>Se hai bisogno di segnalare bug / errori / suggerimenti o qualunque altra domanda relativa al plugin</strong>, puoi lasciarmi un messaggio <a href="http://wordpress.org/tags/nextgen-gallery-date?forum_id=10" target="_blank">nel forum del plugin</a>.</p><p style="font-size:20px;margin-top:20px">Enjoy the web ;)</p>
